# Curve Intersect Result Dispose Method

Source: https://www.revitapidocs.com/2026/6948f056-d028-d292-b5e5-44ce2a57b908.htm

---

| Curve Intersect Result Dispose Method |
| --- |

Releases all resources used by the CurveIntersectResult
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void Dispose()
```

```
Public Sub Dispose
```

```
public:
virtual void Dispose() sealed
```

```
abstract Dispose : unit -> unit
override Dispose : unit -> unit
```

#### Implements

IDisposable Dispose
See Also

#### Reference

CurveIntersectResult Class Autodesk.Revit.DB Namespace